{
  "backend/main.mo": "Empty Motoko actor with no backend logic.",
  "feature_evidence.json": "Feature evidence report defining requirements, associated files, components, and test IDs for the interactive 5‑page birthday experience.",
  "frontend-file-summaries.txt": "JSON mapping of frontend file paths to their high-level summaries for planning and reference.",
  "frontend/index.css": "Base Tailwind layers and CSS variables defining color tokens, dark mode values, and global element styling.",
  "frontend/index.html": "HTML entry point containing root div and script tag loading the React app.",
  "frontend/src/App.tsx": "Main React component controlling page flow, transitions, state, and audio context provider.",
  "frontend/src/components/surprise/audio/MusicControls.tsx": "UI buttons for mute/unmute or initiating audio when autoplay is blocked.",
  "frontend/src/components/surprise/audio/MusicProvider.tsx": "Context provider managing background music playback, mute state, volume, and autoplay handling.",
  "frontend/src/components/surprise/FadeTransition.tsx": "Simple wrapper that applies fade-in or fade-out animation classes based on transition state.",
  "frontend/src/components/surprise/HeartButton.tsx": "Heart-shaped button component triggering navigation with optional label.",
  "frontend/src/components/surprise/ScreenLayout.tsx": "Shared layout component providing page structure with title and configurable background.",
  "frontend/src/components/surprise/screens/Page1Welcome.tsx": "Welcome page showing intro text, feeling selection buttons, ambient effects, and a Next heart button.",
  "frontend/src/components/surprise/screens/Page2Memories.tsx": "Renders a memory selection screen with animated ambient visuals and a heart button to proceed.",
  "frontend/src/components/surprise/screens/Page3Wish.tsx": "Provides a text area for entering a birthday wish along with ambient visuals and a next-step button.",
  "frontend/src/components/surprise/screens/Page4Love.tsx": "Shows a supportive message with glowing ambient effects and a heart button to continue.",
  "frontend/src/components/surprise/screens/Page5Finale.tsx": "Displays the final birthday message with finale animations, shows the user's wish, and offers a replay button.",
  "frontend/src/components/surprise/state/useSurpriseState.ts": "Manages multi-page surprise flow state including feelings, memories, and user wish, with next and replay functions.",
  "frontend/src/components/surprise/visuals/AmbientLayers.tsx": "Generates floating hearts, stars, and glitter effects based on props and intensity settings.",
  "frontend/src/components/surprise/visuals/FinaleEffects.tsx": "Creates finale visuals including confetti hearts, floating balloons, glitter rain, and a pastel background.",
  "frontend/src/components/surprise/visuals/RabbitSprite.tsx": "Displays a cute rabbit sprite in hopping or balloon variant with optional animation.",
  "frontend/src/components/surprise/visuals/SparkleOverlay.tsx": "Renders a tiled sparkle overlay with optional localized area and gold-glow animation.",
  "frontend/src/hooks/useActor.ts": "Initializes and manages a backend actor tied to Internet Identity, refetching dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and logic for Internet Identity authentication, including login, logout, and identity loading.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file indicating that all state is client-side with no backend queries.",
  "frontend/src/index.css": "Defines Tailwind base layers, pastel theme CSS variables, dark mode variants, utility classes, and multiple decorative animation keyframes.",
  "frontend/src/main.tsx": "Bootstraps the React app with ReactDOM, wraps it in React Query and Internet Identity providers, and loads global styles.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, radius, fonts, shadows, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Stores the project’s metadata including design goals, feature list, required images, and architectural notes for a 5‑page birthday website."
}